Repository: ns-88/MikroTikMiniApi
Catalog: MikroTikMiniApi/Resources/Strings.*.resx
Languages: ru_ru

# AuthCmdFailed
source: The authentication command was not executed.
ru_ru: Команда аутентификации не была выполнена.

# AuthFailed
source: Authentication was not performed. API response type: "{0}". Response text: "{1}".
ru_ru: Аутентификация не была произведена. Тип ответа API: "{0}". Текст ответа: "{1}".

# AuthFailedIncorrectAnswer
source: Authentication was not performed. The API response "{0}" was expected to be empty.
ru_ru: Аутентификация не была произведена. Ответ API "{0}" ожидался пустым.

# CmdSendingNotCompleted
source: The command sending was not completed.
ru_ru: Передача команды не была завершена.

# ConnectionLost
source: Communication with the remote host is lost.
ru_ru: Потеряна связь с удаленным хостом.

# ConnectionTimeout
source: The connection was not completed within the specified time period. Timeout: "{0}".
ru_ru: Подключение не было выполнено за установленный период времени. Таймаут: "{0}".

# DataReceivingTimeout
source: The data was not received within the specified time period. Timeout: "{0}".
ru_ru: Получение данных не было выполнено за установленный период времени. Таймаут: "{0}".

# DataSendingTimeout
source: The data was not sent within the specified time period. Timeout: "{0}".
ru_ru: Отправка данных не была выполнена за установленный период времени. Таймаут: "{0}".

# LogoutCmdFailed
source: The logout command was not executed.
ru_ru: Команда выхода не была выполнена.

# LogoutFailed
source: The logout was not performed. API response type: "{0}". Response text: "{1}".
ru_ru: Выход из системы не был произведен. Тип ответа API: "{0}". Текст ответа: "{1}".

# RecvSeqNotComplete
source: Getting the sequence was not completed. API response type: "{0}". Response text: "{1}".
ru_ru: Получение последовательности не было завершено. Тип ответа API: "{0}". Текст ответа: "{1}".

# RecvSeqNotCompleteUnknownRespType
source: Getting the sequence was not completed - unknown type of API response. Response type: "{0}". Response text: "{1}".
ru_ru: Получение последовательности не было завершено - неизвестный тип ответа API. Тип ответа: "{0}". Текст ответа: "{1}".

# ResponseIsEmpty
source: The response text is empty
ru_ru: Текст ответа не задан

# ResponseNotReceived
source: The API response was not received.
ru_ru: Ответ API не был получен.

# ResponseStreamNotCleared
source: The API response stream was not cleared.
ru_ru: Очистка потока ответов API не была произведена.

# ResponseTypeNotReceived
source: The API response type was not received. Response text: "{0}".
ru_ru: Тип ответа API не был получен. Текст ответа: "{0}".

# ResponseWordNotReceived
source: The API response word value was not received.
ru_ru: Значение слова ответа API не было получено.

# SendingCmdDataNotCompleted
source: The sending of the command data was not completed.
ru_ru: Передача данных команды не была завершена.

# SentenceNameNotReceived
source: The name of the sentence type was not received.
ru_ru: Наименование типа предложения не было получено.

# UnknownResponseType
source: Unknown API response type. Response type: "{0}". Response text: "{1}".
ru_ru: Неизвестный тип ответа API. Тип ответа: "{0}". Текст ответа: "{1}".

# WordLengthValueNotReceived
source: The API word length value was not received.
ru_ru: Значение длины слова API не было получено.
